---
kind: type
id: T:Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings
source: html/936b709f-0cf4-c5ab-bfa9-2f4e340f4037.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings

Contains color settings for analysis display style element.

## Syntax (C#)
```csharp
public class AnalysisDisplayColorSettings : IDisposable
```